blazoncek/esp8266_mqtt_leds/effects.cpp
//------------------------------------------------------//
void Twinkle(int SpeedDelay, boolean OnlyOne) {
  CRGB c = CHSV(gHue, 255, 255);
  
  for ( int z=(bobClient && bobClient.connected())?1:0; z<numZones; z++ ) {

    if ( !OnlyOne )
      fadeToBlackBy(leds[z], numLEDs[z], 16);
    else
      fill_solid(leds[z], numLEDs[z], CRGB::Black);

    for ( int s=0; s<numSections[z]; s++ ) {
      int pos = random16(sectionStart[z][s], sectionEnd[z][s]+1);
      leds[z][pos] = c;
    }
  }
  showStrip();
  FastLED.delay(SpeedDelay);
}

//------------------------------------------------------//
void TwinkleRandom(int SpeedDelay, boolean OnlyOne) {
  gHue = random8();
  Twinkle(SpeedDelay, OnlyOne);
}

//------------------------------------------------------//
// borrowed from FastLED's DemoReel
void sinelon(int SpeedDelay) {

  // a colored dot sweeping back and forth, with fading trails
  for ( int z=(bobClient && bobClient.connected())?1:0; z<numZones; z++ ) {
    fadeToBlackBy(leds[z], numLEDs[z], 16);
    for ( int s=0; s<numSections[z]; s++ ) {
      int pos = beatsin16(12, sectionStart[z][s], sectionEnd[z][s]);
      if ( s%2 )
        pos = (sectionEnd[z][s]-pos) + sectionStart[z][s];
      leds[z][pos] = CHSV(gHue, 255, 255);
    }
  }
  showStrip();
  FastLED.delay(SpeedDelay);

  gHue++;
}

//------------------------------------------------------//
// borrowed from FastLED's DemoReel
void bpm(int SpeedDelay) {

  // colored stripes pulsing at a defined Beats-Per-Minute (BPM)
  uint8_t BeatsPerMinute = 62;
  CRGBPalette16 palette = RainbowColors_p; // PartyColors_p;
  uint8_t beat = beatsin8(BeatsPerMinute, 32, 255);
  for ( int z=(bobClient && bobClient.connected())?1:0; z<numZones; z++ ) {
    for ( int s=0; s<numSections[z]; s++ ) {
      for ( int i=sectionStart[z][s]; i<=sectionEnd[z][s]; i++ ) { //9948
        int hue = s%2 ? ((sectionEnd[z][s]-i)*2) : ((i-sectionStart[z][s])*2);
        int val = s%2 ? ((sectionEnd[z][s]-i)*10) : ((i-sectionStart[z][s])*10);
        leds[z][i] = ColorFromPalette(palette, gHue+hue, beat-gHue+val);
      }
    }
  }
  showStrip();
  FastLED.delay(SpeedDelay);

  gHue++;
}

//------------------------------------------------------//
// borrowed from FastLED's DemoReel
void juggle(int SpeedDelay) {

  // eight colored dots, weaving in and out of sync with each other
  for ( int z=(bobClient && bobClient.connected())?1:0; z<numZones; z++ ) {
    fadeToBlackBy(leds[z], numLEDs[z], 64);
    for ( int s=0; s<numSections[z]; s++ ) {
      byte dothue = 0;
      for ( int i=0; i<8; i++ ) {
        int pos = beatsin16(i+7, sectionStart[z][s], sectionEnd[z][s]);
        if ( s%2 )
          pos = (sectionEnd[z][s]-pos) + sectionStart[z][s];
        leds[z][pos] |= CHSV(dothue, 255, 255);
        dothue += 32;
      }
    }
  }
  showStrip();
  FastLED.delay(SpeedDelay);
}


//------------------------------------------------------//
void Sparkle(int SpeedDelay, CRGB c) {

  for ( int z=(bobClient && bobClient.connected())?1:0; z<numZones; z++ ) {
    fill_solid(leds[z], numLEDs[z], c);
    for ( int s=0; s<numSections[z]; s++ ) {
      addGlitter(z, s, 75);
    }
  }
  showStrip();
  FastLED.delay(SpeedDelay);
}

//------------------------------------------------------//
void snowSparkle(int SpeedDelay) {
  Sparkle(SpeedDelay, CRGB(16,16,16));
}

//------------------------------------------------------//
void runningLights(int WaveDelay) {
  static unsigned int offset = 0;
  
  for ( int z=(bobClient && bobClient.connected())?1:0; z<numZones; z++ ) {
    for ( int s=0; s<numSections[z]; s++ ) {
      int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s]+1;
      for ( int i=0; i<ledsPerSection; i++ ) {
        unsigned int level = sin8( (i*1280/ledsPerSection + offset) & 0xFF );  // 5 waves
        if ( s%2 ) {
          leds[z][sectionEnd[z][s] - i-1] = CHSV(gHue, 255, level);
        } else {
          leds[z][sectionStart[z][s] + i] = CHSV(gHue, 255, level);
        }
      }
    }
  }
  showStrip();
  FastLED.delay(WaveDelay);

  gHue++;
  offset = (offset + 21) & 0xFF;
}

//------------------------------------------------------//
void colorWipe(int WipesPerMinute, boolean Reverse) {
  static unsigned int pct = 0;  // starting position
  static boolean blank = false;
  CRGB c;

  uint8_t beat = (beat8(WipesPerMinute*2)+2)*100/255; // double the speed (colored & black wipes)
  if ( pct == beat ) {  // if there is no change in position just exit
    FastLED.delay(5);
    return;
  } else if ( pct > beat && pct > 99 ) {  // roll-over, erase the section
    blank = !blank;
    if ( blank ) gHue += 8; // slightly change the hue
  } else if ( pct > beat && pct < 100 ) {
    beat = 100;
  }
  pct = beat; // percent fill
  
  if ( blank ) {
    c = CRGB::Black;
  } else {
    c = CHSV(gHue, 255, 255);
  }
  for ( int z=(bobClient && bobClient.connected())?1:0; z<numZones; z++ ) {
    for ( int s=0; s<numSections[z]; s++ ) {
      unsigned int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s]+1;
      unsigned int nLeds = (pct * ledsPerSection) / 100;
      if ( !Reverse != !(bool)(s%2) ) { // Reverse XOR s==odd
        fill_solid(&leds[z][sectionEnd[z][s]-nLeds+1], nLeds, c);
      } else {
        fill_solid(&leds[z][sectionStart[z][s]], nLeds, c);
      }
    }
  }
  showStrip();
  FastLED.delay(30);
}

//------------------------------------------------------//
void colorChase(CRGB c[], int Size, int SpeedDelay, boolean Reverse) {
  uint8_t window = 3*Size;  // c[] has 3 elements
  static uint8_t q = 0;

  // move by 1 pixel within window
  ++q %= window;
  for ( int z=(bobClient && bobClient.connected())?1:0; z<numZones; z++ ) {

    for ( int s=0; s<numSections[z]; s++ ) {
      int ledsPerSection = sectionEnd[z][s]-sectionStart[z][s]+1;
      int delta = (s%2?-1:1) * max(1,255/ledsPerSection);
      uint8_t hue = (s%2 ? (ledsPerSection-1)*abs(delta) : 0) + gHue;

      if ( c[0].getLuma()==0 && c[1].getLuma()==0 && c[2].getLuma()==0 ) {  // all black so we do a rainbow chase
        fill_rainbow(&leds[z][sectionStart[z][s]], ledsPerSection, hue, delta);
      } else {
        fill_solid(&leds[z][sectionStart[z][s]], ledsPerSection, c[2]);
      }

      for ( int i=0; i<ledsPerSection; i+=window ) {
        // turn LEDs on: ..++++####....++++####..   (size=4, . = black, + = c1, # = c2)
        // turn LEDs on: ..####++++....####++++..   (size=4, . = black, + = c1, # = c2, Reverse)
        for ( int j=0; j<Size; j++ ) {
          uint16_t pos = q + j;

          // Every odd section is reversed (zig-zag mounted strips)
          if ( !Reverse != !(bool)(s%2) ) { // Reverse XOR s==odd
            if ( pos%window + i < ledsPerSection )
              leds[z][sectionEnd[z][s] - pos%window - i] = c[0];
            if ( (pos+Size)%window + i < ledsPerSection )
              leds[z][sectionEnd[z][s] - (pos+Size)%window - i] = c[1];
          } else {
            if ( pos%window + i < ledsPerSection )
              leds[z][sectionStart[z][s] + pos%window + i] = c[0];
            if ( (pos+Size)%window + i < ledsPerSection )
              leds[z][sectionStart[z][s] + (pos+Size)%window + i] = c[1];
          }

